app/controllers/account_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "jennyvarg90"], ["LIMIT", 1]]
---
      def set_account
        @account = User.find_by(username: params[:account])